In [1]:
# https://www.kaggle.com/c/titanic/data
# download titanic dataset from the link above. Sign up to Kaggle to download the titanic data set.
library("readxl")
setwd('C:/Users/Deniz/Data/')

In [2]:
# read test.csv and train.csv assign the data frame to titanicTrain and titanicTest seperately.
titanicTrain <- read.csv(file.path("train.csv"))
titanicTest <- read.csv(file.path("test.csv"))

In [3]:
# by using head and tail functions see first 8 rows of both titanicTrain and titanicTest
head(titanicTrain,8)
head(titanicTest,8)

  PassengerId Survived Pclass
1 1           0        3
2 2           1        1
3 3           1        3
4 4           1        1
5 5           0        3
6 6           0        3
7 7           0        1
8 8           0        3
  Name                                                Sex    Age SibSp Parch
1 Braund, Mr. Owen Harris                             male   22  1     0
2 Cumings, Mrs. John Bradley (Florence Briggs Thayer) female 38  1     0
3 Heikkinen, Miss. Laina                              female 26  0     0
4 Futrelle, Mrs. Jacques Heath (Lily May Peel)        female 35  1     0
5 Allen, Mr. William Henry                            male   35  0     0
6 Moran, Mr. James                                    male   NA  0     0
7 McCarthy, Mr. Timothy J                             male   54  0     0
8 Palsson, Master. Gosta Leonard                      male    2  3     1
  Ticket           Fare    Cabin Embarked
1 A/5 21171         7.2500       S
2 PC 17599         71.2833 C85   C
3 STON/O2. 3101282  7.9250       S
4 113803           53.1000 C123  S
5 373450            8.0500       S
6 330877            8.4583       Q
7 17463            51.8625 E46   S
8 349909           21.0750       S

  PassengerId Pclass Name                                         Sex    Age
1 892         3      Kelly, Mr. James                             male   34.5
2 893         3      Wilkes, Mrs. James (Ellen Needs)             female 47.0
3 894         2      Myles, Mr. Thomas Francis                    male   62.0
4 895         3      Wirz, Mr. Albert                             male   27.0
5 896         3      Hirvonen, Mrs. Alexander (Helga E Lindqvist) female 22.0
6 897         3      Svensson, Mr. Johan Cervin                   male   14.0
7 898         3      Connolly, Miss. Kate                         female 30.0
8 899         2      Caldwell, Mr. Albert Francis                 male   26.0
  SibSp Parch Ticket  Fare    Cabin Embarked
1 0     0     330911   7.8292       Q
2 1     0     363272   7.0000       S
3 0     0     240276   9.6875       Q
4 0     0     315154   8.6625       S
5 1     1     3101298 12.2875       S
6 0     0     7538     9.2250       S
7 0     0     330972   7.6292       Q
8 1     1     248738  29.0000       S

In [4]:
# Find the dimensions of both titanicTrain and titanicTest if there is any difference with column numbers explain the reason
dim(titanicTrain) #891rows and 12 columns
dim(titanicTest)  #418rows and 11 columns

[1] 891  12

[1] 418  11

In [5]:
# By using str and summary function examine data.
str(titanicTrain)
summary(titanicTrain)
str(titanicTest)
summary(titanicTest)

'data.frame':	891 obs. of  12 variables:
 $ PassengerId: int  1 2 3 4 5 6 7 8 9 10 ...
 $ Survived   : int  0 1 1 1 0 0 0 0 1 1 ...
 $ Pclass     : int  3 1 3 1 3 3 1 3 3 2 ...
 $ Name       : chr  "Braund, Mr. Owen Harris" "Cumings, Mrs. John Bradley (Florence Briggs Thayer)" "Heikkinen, Miss. Laina" "Futrelle, Mrs. Jacques Heath (Lily May Peel)" ...
 $ Sex        : chr  "male" "female" "female" "female" ...
 $ Age        : num  22 38 26 35 35 NA 54 2 27 14 ...
 $ SibSp      : int  1 1 0 1 0 0 0 3 0 1 ...
 $ Parch      : int  0 0 0 0 0 0 0 1 2 0 ...
 $ Ticket     : chr  "A/5 21171" "PC 17599" "STON/O2. 3101282" "113803" ...
 $ Fare       : num  7.25 71.28 7.92 53.1 8.05 ...
 $ Cabin      : chr  "" "C85" "" "C123" ...
 $ Embarked   : chr  "S" "C" "S" "S" ...

  PassengerId       Survived          Pclass          Name
 Min.   :  1.0   Min.   :0.0000   Min.   :1.000   Length:891
 1st Qu.:223.5   1st Qu.:0.0000   1st Qu.:2.000   Class :character
 Median :446.0   Median :0.0000   Median :3.000   Mode  :character
 Mean   :446.0   Mean   :0.3838   Mean   :2.309
 3rd Qu.:668.5   3rd Qu.:1.0000   3rd Qu.:3.000
 Max.   :891.0   Max.   :1.0000   Max.   :3.000

     Sex                 Age            SibSp           Parch
 Length:891         Min.   : 0.42   Min.   :0.000   Min.   :0.0000
 Class :character   1st Qu.:20.12   1st Qu.:0.000   1st Qu.:0.0000
 Mode  :character   Median :28.00   Median :0.000   Median :0.0000
                    Mean   :29.70   Mean   :0.523   Mean   :0.3816
                    3rd Qu.:38.00   3rd Qu.:1.000   3rd Qu.:0.0000
                    Max.   :80.00   Max.   :8.000   Max.   :6.0000
                    NA's   :177
    Ticket               Fare           Cabin             Embarked
 Length:891         Min.   :  0.00   Length:891         Length:891
 Class :character   1st Qu.:  7.91   Class :character   Class :character
 Mode  :character   Median : 14.45   Mode  :character   Mode  :character
                    Mean   : 32.20
                    3rd Qu.: 31.00
                    Max.   :512.33

'data.frame':	418 obs. of  11 variables:
 $ PassengerId: int  892 893 894 895 896 897 898 899 900 901 ...
 $ Pclass     : int  3 3 2 3 3 3 3 2 3 3 ...
 $ Name       : chr  "Kelly, Mr. James" "Wilkes, Mrs. James (Ellen Needs)" "Myles, Mr. Thomas Francis" "Wirz, Mr. Albert" ...
 $ Sex        : chr  "male" "female" "male" "male" ...
 $ Age        : num  34.5 47 62 27 22 14 30 26 18 21 ...
 $ SibSp      : int  0 1 0 0 1 0 0 1 0 2 ...
 $ Parch      : int  0 0 0 0 1 0 0 1 0 0 ...
 $ Ticket     : chr  "330911" "363272" "240276" "315154" ...
 $ Fare       : num  7.83 7 9.69 8.66 12.29 ...
 $ Cabin      : chr  "" "" "" "" ...
 $ Embarked   : chr  "Q" "S" "Q" "S" ...

  PassengerId         Pclass          Name               Sex
 Min.   : 892.0   Min.   :1.000   Length:418         Length:418
 1st Qu.: 996.2   1st Qu.:1.000   Class :character   Class :character
 Median :1100.5   Median :3.000   Mode  :character   Mode  :character
 Mean   :1100.5   Mean   :2.266
 3rd Qu.:1204.8   3rd Qu.:3.000
 Max.   :1309.0   Max.   :3.000

      Age            SibSp            Parch           Ticket
 Min.   : 0.17   Min.   :0.0000   Min.   :0.0000   Length:418
 1st Qu.:21.00   1st Qu.:0.0000   1st Qu.:0.0000   Class :character
 Median :27.00   Median :0.0000   Median :0.0000   Mode  :character
 Mean   :30.27   Mean   :0.4474   Mean   :0.3923
 3rd Qu.:39.00   3rd Qu.:1.0000   3rd Qu.:0.0000
 Max.   :76.00   Max.   :8.0000   Max.   :9.0000
 NA's   :86
      Fare            Cabin             Embarked
 Min.   :  0.000   Length:418         Length:418
 1st Qu.:  7.896   Class :character   Class :character
 Median : 14.454   Mode  :character   Mode  :character
 Mean   : 35.627
 3rd Qu.: 31.500
 Max.   :512.329
 NA's   :1

In [6]:
# Are there any duplications in titanicTrain? 
sum(duplicated(titanicTest))

[1] 0

In [7]:
# Drop passengerID. Why did we choose to drop passengerID?
titanicTest$PassengerId <- NULL

In [8]:
# Find unique numbers In Pclass column, then name 1 as "1st class", name 2 as "2nd class", name 3 as "3rd class" by using if else
unique(titanicTest$Pclass)
titanicTest$Pclass <-ifelse(titanicTest$Pclass == "1", "1st class", ifelse(titanicTest$Pclass == "2", "2nd class", "3rd class"))
head(titanicTest)

[1] 3 2 1

  Pclass    Name                                         Sex    Age  SibSp
1 3rd class Kelly, Mr. James                             male   34.5 0
2 3rd class Wilkes, Mrs. James (Ellen Needs)             female 47.0 1
3 2nd class Myles, Mr. Thomas Francis                    male   62.0 0
4 3rd class Wirz, Mr. Albert                             male   27.0 0
5 3rd class Hirvonen, Mrs. Alexander (Helga E Lindqvist) female 22.0 1
6 3rd class Svensson, Mr. Johan Cervin                   male   14.0 0
  Parch Ticket  Fare    Cabin Embarked
1 0     330911   7.8292       Q
2 0     363272   7.0000       S
3 0     240276   9.6875       Q
4 0     315154   8.6625       S
5 1     3101298 12.2875       S
6 0     7538     9.2250       S

In [9]:
# Find number of NAs for both titanicTrain and titanicTest in Age column.
table(is.na(titanicTrain$Age))

FALSE  TRUE
  714   177

In [10]:
# Are there any columns that have NAs except for Age column? If yes, explain.
sum(is.na(titanicTest$Age))

[1] 86

In [11]:
# Plot boxplot for both titanicTrain and titanicTest in Age column

In [14]:
# Replace NAs with mean or median for both titanicTrain and titanicTest and explain why did you choose? 
titanicTrain$Age[is.na(titanicTrain$age)] = median(titanicTrain$age , na.rm = TRUE)
titanicTest$Age[is.na(titanicTest$age)] = median(titanicTest$age , na.rm = TRUE)
#If you have outliers, use median

NULL

In [9]:
# How many of the survivors female?
table(titanicTrain$Sex,titanicTrain$Survived)

           0   1
  female  81 233
  male   468 109